backend/app/controllers/api/v1/todos_controller.rb

SELECT `todos`.* FROM `todos`
---
  def index
    @todos = Todo.all

INSERT INTO `todos` (`title`, `completed`, `created_at`, `updated_at`) VALUES ('タスク１', FALSE, '2025-08-15 09:04:31.810070', '2025-08-15 09:04:31.810070')
---
  def create
    @todo = Todo.new(todo_params)

    if @todo.save

DELETE FROM `todos` WHERE `todos`.`id` = 1
---
  def destroy
    @todo.destroy

SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 1 LIMIT 1
---
  def set_todo
    @todo = Todo.find(params[:id])